app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("nombre", "precio", "desc", "stock", "disponible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nombre", "juego"], ["precio", 5000.0], ["desc", "asdf"], ["stock", 10], ["disponible", "t"], ["created_at", "2017-08-15 15:23:44.612575"], ["updated_at", "2017-08-15 15:23:44.612575"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "precio" = ?, "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["precio", 400.0], ["stock", 14], ["updated_at", "2017-08-17 16:25:47.646101"], ["id", 1]]

  def reportes
    @products = Product.all
---
SELECT "products".* FROM "products"